[{"author": "AlmondBoyOfSJ", "title": "GME 2/9", "content": "GME is the new toilet paper", "stock": "GME"}, {"author": "bag_on_tic", "title": "Daily Discussion Thread for February 09, 2021", "content": "Long live PLUG. SPWR too", "stock": "SPWR"}, {"author": "robb0688", "title": "SNDL This week!", "content": "Aphria train right here for some sweet arbitrage. Apha shares will be 0.8381 TLRY shares upon merging. Currently trading at 0.5-0.6x tlry.\n\nNot financial advice.", "stock": "TLRY"}, {"author": "ReeferSullivan", "title": "GME 2/9", "content": "Fuck you talking about? I’m not saying I’m teaching anyone, just saying that there is no reason to be in here trolling, it’s a waste of your time. I’m sure ppl will realize after GME is all over that they shouldn’t jump on everything WSB says. It’s a good life lesson.", "stock": "GME"}, {"author": "Nearin", "title": "Weed about to make me a millionaire in 2021 🌳🚀🌳🚀🌳🚀", "content": "Great arbitrage Value on APHA right now assuming TLRY doesn't crash, im buying calls. \n\n&amp;#x200B;\n\nAt $40 USD Tilray the implied APHA SP is $33 USD/$42CAD.", "stock": "APHA TLRY APHA"}, {"author": "Viznab88", "title": "GME Holders on 2/9", "content": "I invested in changing a broken/cheated system.\n\nMy investment going to 0 means the system won, and that we are to only play by the rules set out  by the ones in power. Effectively means, you can only win against your small fellow retail investor, never against big money.\n\nI can accept that and play the game by those rules - no problem, have been doing that for a long while. However, it was worth my investment to try and turn it around.\n\nIMO this was the only chance - by now it is clear that the system cannot be changed by us. Ergo, we will never have the same opportunity.\n\nCall me a sentimentalist, but I'm sad more about that than the loss of the money I threw at it.", "stock": "IMO"}, {"author": "Effective-Estimate92", "title": "Y'all need to let GME happen", "content": "GME is like PLTR here circa November. So many haters by December and look at my baby now...", "stock": "GME"}, {"author": "1mikeg", "title": "Weed about to make me a millionaire in 2021 🌳🚀🌳🚀🌳🚀", "content": "Yeah, they get 3 in a year, one for revenue, spending, and the federal debt limit.  A new federal tax on weed sales and interstate distribution could easily be construed as a revenue reconciliation bill.", "stock": "A"}, {"author": "Kaslight", "title": "PROOF that GME is not a sell off but short attacks", "content": "This seems to be the obvious answer. All these armchair ladder attack short squeeze gurus are making all these predictions but the only constant here is that GME continues to Meteor and goalposts move. \n\nToday was supposed to be the day, and it's dropping to a new floor. If nothing magical happens today, you guys left should honestly just cut your losses.\n\nThese HFs not only already have the info we were hoping for, but they have resources we don't too. We beat them because we blindsided them, but at this point its clear they have successfully responded.\n\nLike Cuban said....NEXT TIME, wsb can actually win. But not by ignoring common sense and becoming an internet cult.", "stock": "GME"}, {"author": "LlamaDrama4YoMama", "title": "(CLNE) DD. The path of least resistance, and most gains.", "content": "Exxon and WTI have been good to me the last month.", "stock": "WTI"}]